[
    {
        "id": 16,
        "portfolioName": "Vacaciones",
        "clientName": "Banco Santander",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FVacaciones.png?alt=media&token=0228cbf1-636e-4828-ba86-d962eff0bc2a",
        "description": "En este proyecto, participé en la migración de un sistema de solicitud de vacaciones para los colaboradores del Banco Santander, actualizando una aplicación antigua desarrollada en C# y ASP.NET a una versión moderna utilizando tecnologías actuales. La actualización involucró la utilización de Java 11 con Spring Boot para el backend y Angular 12 para el frontend.\n\nFuncionalidades del Sistema:\n1.\tEl sistema renovado incluye varias funcionalidades clave para la gestión de las solicitudes de vacaciones:\n2.\tSolicitud de Vacaciones: Los colaboradores pueden realizar solicitudes de vacaciones de manera sencilla.\n3.\tSolicitud de Bonos: Los colaboradores tienen la opción de solicitar un bono si cumplen con un mínimo de días de vacaciones establecidos.\n4.\tReversa de Solicitud: Posibilidad de cancelar solicitudes de vacaciones previamente realizadas.\n5.\tHistorial de Solicitudes: Acceso al historial completo de solicitudes de vacaciones de cada colaborador.\n6.\tNotificaciones por Correo Electrónico: Envío automático de correos electrónicos al supervisor del colaborador para la aprobación o rechazo de las solicitudes de vacaciones.\n\nMi principal función en este proyecto fue en el área de frontend. Tuve que adaptarme rápidamente al proyecto, ya que el equipo estaba trabajando contra el reloj para cumplir con los plazos de entrega, esto debido a que ingresé al equipo en medio del desarrollo de este producto. A pesar de estos desafíos, logré integrarme eficazmente y contribuir significativamente al éxito del proyecto.\n\nUna vez entregada la aplicación, tuve que saldar una deuda técnica mencionada por el arquitecto, la cual consistía en dejar de enviar correos por medio de un servidor SMTP y utilizar un microservicio realizado por otro equipo para la gestión de envío de correos. Este ajuste mejoró la modularidad y eficiencia del sistema de notificaciones.\n\nAlgunos de los logros que quiero destacar son:\n1.\tAdaptación Rápida: Logré adaptarme rápidamente a las tecnologías y a las necesidades del proyecto, garantizando que el trabajo se realizara de manera eficiente y efectiva.\n2.\tEntrega Exitosa: Contribuí a cumplir con los tiempos de entrega establecidos, logrando satisfacer las expectativas del Product Owner, Tech Lead y Scrum Master.\n3.\tCumplimiento de Expectativas: Mi trabajo en el frontend fue reconocido por su calidad y eficiencia, alineándose perfectamente con los requisitos y expectativas del equipo de liderazgo del proyecto.\n\nEste proyecto no solo me permitió fortalecer mis habilidades técnicas en Angular, sino también demostrar mi capacidad para trabajar bajo presión y adaptarme rápidamente a nuevos entornos de trabajo. La colaboración y el cumplimiento de los objetivos del equipo fueron clave para el éxito de esta migración, lo que resultó en un sistema más moderno y eficiente para los colaboradores del Banco Santander.",
        "repository": "",
        "demo": "",
        "startDate": "2023-07-16T04:00:00",
        "endDate": "2023-09-01T04:00:00",
        "publishDate": "2024-05-26T23:08:07",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 29,
                "name": "Gitlab",
                "version": null
            },
            {
                "id": 18,
                "name": "Jenkins",
                "version": null
            },
            {
                "id": 3,
                "name": "CSS3",
                "version": null
            },
            {
                "id": 2,
                "name": "HTML5",
                "version": ""
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 21,
                "name": "TypeScript",
                "version": null
            },
            {
                "id": 40,
                "name": "Angular Material",
                "version": null
            },
            {
                "id": 23,
                "name": "Angular",
                "version": "12"
            },
            {
                "id": 44,
                "name": "SQL Server 2012",
                "version": null
            },
            {
                "id": 45,
                "name": "T-SQL",
                "version": null
            },
            {
                "id": 4,
                "name": "Maven",
                "version": null
            },
            {
                "id": 7,
                "name": "Java",
                "version": "11"
            },
            {
                "id": 11,
                "name": "Springboot",
                "version": null
            },
            {
                "id": 19,
                "name": "Spring Web",
                "version": null
            }
        ],
        "category": {
            "id": 9,
            "name": "Profesional",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 15,
        "portfolioName": "Control de Presupuesto",
        "clientName": "Red MegaCentro",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FMegaCentro.png?alt=media&token=3304fad1-800d-4a14-aeae-39fa25c1f615",
        "description": "Como parte de 42Labs,  tuvims que realziar una colaboración con MegaCentro Perú, donde llevé a cabo un proyecto de ingeniería inversa centrado en un software de gestión de bodega desarrollado en Microsoft Access. El objetivo principal fue comprender a fondo la estructura y funcionalidades del aplicativo para proporcionar mejoras y documentación exhaustiva.\n\nEl proceso inició con reuniones detalladas con el cliente, MegaCentro Perú, donde se recibió información esencial sobre el software existente. Este, específicamente diseñado para la gestión de bodegas y la elaboración de presupuestos de construcción, presentaba desafíos debido a su complejidad y a la falta de documentación clara.\n\nMi labor consistió en realizar una ingeniería inversa del aplicativo. Esto implicó una exhaustiva inspección de la base de datos subyacente para identificar las tablas, campos y tipos de datos utilizados. El propósito era comprender la estructura de la información almacenada y facilitar la creación de descripciones detalladas para los usuarios finales. Además, llevé a cabo una inspección a fondo de la interfaz de usuario y funcionalidades de la aplicación. Esta evaluación minuciosa permitió la creación de un manual de usuario completo, que detallaba de manera clara y concisa los procesos y pasos para maximizar la eficiencia en el uso del software.\n\nEn paralelo, mi jefe de proyecto lideró la creación de diagramas correspondientes que visualizaban la arquitectura y relaciones del software. Estos diagramas fueron esenciales para comprender la lógica de negocio y garantizar una implementación coherente de mejoras.\n\nEl proyecto culminó con éxito, cumpliendo con las expectativas del cliente. La entrega de mejoras sustanciales, el manual de usuario detallado y los diagramas visuales proporcionaron una solución integral que optimizó la experiencia del usuario. La satisfacción del cliente al final del proyecto destacó la efectividad de la ingeniería inversa aplicada y la capacidad para brindar soluciones prácticas a desafíos complejos. Este proyecto ahora forma parte integral de mi portafolio, destacando mi habilidad para abordar proyectos de ingeniería inversa con éxito y generar valor añadido para los clientes.",
        "repository": "",
        "demo": "",
        "startDate": "2023-06-18T04:00:00",
        "endDate": "2023-07-27T04:00:00",
        "publishDate": "2023-12-27T15:16:07",
        "technologies": [
            {
                "id": 43,
                "name": "Microsoft Access",
                "version": null
            }
        ],
        "category": {
            "id": 9,
            "name": "Profesional",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 14,
        "portfolioName": "Trello Clone",
        "clientName": "",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FTrello-clone.png?alt=media&token=2e17e5bf-64ea-4c46-bc8f-9a721f464c89",
        "description": "Este proyecto representa una travesía en la que emprendí como parte de un curso especializado en maquetación con Angular CDK y TailwindCSS. Es por eso que me gustaría expresar y compartir los conocmientos adquiridos en el proceso. A medida que avanzaba en el curso, quedaba cada vez más asombrado por la potencia y versatilidad que ofrece Angular CDK. Lo más notable es la capacidad de integrar estos componentes directamente en mi aplicación sin comprometer el diseño general, gracias al uso sin complicaciones de TailwindCSS, un framework de estilos que se integra perfectamente con Angular. \n\nDentro de las herramientas y componentes que exploré y dominé en este curso, se encuentran: \n\n1. Overlay: Descubrí cómo crear superposiciones elegantes, ideales para ventanas emergentes y notificaciones. Esta funcionalidad proporciona una forma sencilla pero efectiva de comunicarse con el usuario de manera clara y visualmente atractiva. \n2. Modals: Aprendí a implementar ventanas modales de manera eficaz, un aspecto fundamental para mejorar la interacción del usuario. La capacidad de presentar información adicional o realizar acciones específicas en un formato modal contribuye significativamente a la usabilidad de la aplicación. \n3. Tables: Me sumergí en la creación de tablas dinámicas y personalizables que permiten mostrar datos de manera ordenada y fácilmente comprensible. La versatilidad de estas tablas resulta esencial para la presentación efectiva de información en diversos contextos. \n4. Acordeones: Exploré el diseño de acordeones que posibilitan mostrar u ocultar contenido de forma intuitiva. Esta funcionalidad es especialmente útil cuando se trata de organizar y presentar información de manera estructurada, mejorando la experiencia del usuario. .\n5. Drag and Drop: Una de las partes más emocionantes del curso fue aprender a implementar la funcionalidad de arrastrar y soltar de manera eficiente. Esta capacidad ofrece una experiencia de usuario fluida y agradable, permitiendo a los usuarios interactuar de manera natural con los elementos de la interfaz. \n\nEn resumen, este proyecto no solo representó un desafío estimulante, sino que también proporcionó una experiencia valiosa en la creación de interfaces de usuario utilizando Angular CDK y TailwindCSS. La integración de estos componentes no solo enriqueció mis habilidades de desarrollo web, sino que también abrió nuevas perspectivas sobre la creación de experiencias de usuario impactantes y eficientes.",
        "repository": "https://github.com/crisortegamunoz/trello-clone",
        "demo": "https://trello-clone-4b581.web.app/",
        "startDate": "2023-06-01T04:00:00",
        "endDate": "2023-06-09T04:00:00",
        "publishDate": "2023-09-03T02:07:18",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 27,
                "name": "Github",
                "version": null
            },
            {
                "id": 42,
                "name": "TailwindCSS",
                "version": null
            },
            {
                "id": 21,
                "name": "TypeScript",
                "version": null
            },
            {
                "id": 25,
                "name": "Angular",
                "version": "15"
            },
            {
                "id": 40,
                "name": "Angular Material",
                "version": null
            }
        ],
        "category": {
            "id": 10,
            "name": "Laboratorio",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 13,
        "portfolioName": "Platzi Store",
        "clientName": "",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2Fplatzi-store.png?alt=media&token=c6ebc84e-c3a6-495a-938f-24a49f9cb783",
        "description": "Platzi Store representa una simulación de una plataforma de comercio electrónico, diseñada específicamente para ser utilizada como proyecto práctico en los cursos iniciales de Angular. Estos cursos abarcan una amplia gama de conceptos fundamentales, desde los aspectos básicos hasta temas más avanzados como la comunicación efectiva entre componentes, el consumo de servicios mediante API's, la implementación de técnicas como Lazy Loading y la modularización del código, entre otros. \n\nEste proyecto se ha revelado como una herramienta invaluable para consolidar y revisitar los fundamentos esenciales de Angular. En mi caso, que previamente me había enfocado y especializado principalmente en el desarrollo del backend, Platzi Store me brindó la oportunidad de reforzar mis conocimientos en el ámbito del frontend. La aplicación práctica de estos conceptos en un entorno de comercio electrónico simulado ha añadido un valor significativo a mi comprensión general de Angular y su aplicación en proyectos del mundo real.",
        "repository": "https://github.com/crisortegamunoz/platzi-store-angular",
        "demo": "https://yarnstore-e4716.web.app/",
        "startDate": "2023-05-01T04:00:00",
        "endDate": "2023-05-26T04:00:00",
        "publishDate": "2023-09-03T01:49:20",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 27,
                "name": "Github",
                "version": null
            },
            {
                "id": 2,
                "name": "HTML5",
                "version": ""
            },
            {
                "id": 3,
                "name": "CSS3",
                "version": null
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 21,
                "name": "TypeScript",
                "version": null
            },
            {
                "id": 24,
                "name": "Angular",
                "version": "13"
            },
            {
                "id": 33,
                "name": "Firebase Hosting",
                "version": null
            }
        ],
        "category": {
            "id": 10,
            "name": "Laboratorio",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 12,
        "portfolioName": "Seguros Generales",
        "clientName": "CLAVE - Tecnología",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FPAC.png?alt=media&token=8fe3220e-cf67-4af6-8076-c223b41e50ca",
        "description": "Parte de Kinetyc Platform, en contraste con el módulo de Líneas Comerciales, conocido como \"PAC\", se centra en procesos de autoatención destinados a clientes y canales relacionados con la cotización, propuesta, suscripción y emisión de seguros generales. Es crucial destacar que los usuarios finales pueden llevar a cabo este flujo específicamente mediante el acceso a través de una campaña comercial. \n\n Mi participación en este proyecto inició en calidad de desarrollador FullStack, abarcando tareas de mantenimiento y la creación de nuevas funcionalidades. Más adelante, asumí un papel más integral en la aplicación al participar directamente en reuniones con el cliente. Esto me llevó a analizar la factibilidad de los requerimientos y a evaluar la implementación de estos en la plataforma. Además, asumí la responsabilidad de liderar un equipo, asignando tareas una vez creadas las historias de usuario. \n\n Dentro de mis logros notables, destaca la optimización significativa de los tiempos de respuesta en diversos servicios, logrando reducciones de tiempo que oscilaron entre un 30% y un 70%, dependiendo del servicio. Asimismo, contribuí a fortalecer la relación con el cliente al entregar los requerimientos solicitados en los plazos acordados. \n\n Enfrenté uno de los mayores desafíos al asumir el rol de líder técnico, experimentando el síndrome del impostor al principio, ya que no me sentía completamente preparado. Con el tiempo, fortalecí mi posición y lideré mejoras importantes para el equipo. Esto incluyó la optimización de la inducción de nuevos desarrolladores y la promoción de un ambiente de trabajo más positivo. Este último aspecto es particularmente significativo, ya que el estado de ánimo del equipo experimentó mejoras sustanciales.",
        "repository": "",
        "demo": "",
        "startDate": "2021-08-09T04:00:00",
        "endDate": "2023-05-31T04:00:00",
        "publishDate": "2023-09-02T15:41:45",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 28,
                "name": "Bitbucket",
                "version": null
            },
            {
                "id": 18,
                "name": "Jenkins",
                "version": null
            },
            {
                "id": 4,
                "name": "Maven",
                "version": null
            },
            {
                "id": 14,
                "name": "Oracle",
                "version": null
            },
            {
                "id": 17,
                "name": "PL/SQL",
                "version": null
            },
            {
                "id": 7,
                "name": "Java",
                "version": "11"
            },
            {
                "id": 11,
                "name": "Springboot",
                "version": null
            },
            {
                "id": 12,
                "name": "Spring Data JPA",
                "version": null
            },
            {
                "id": 13,
                "name": "Spring Security",
                "version": null
            },
            {
                "id": 19,
                "name": "Spring Web",
                "version": null
            },
            {
                "id": 2,
                "name": "HTML5",
                "version": ""
            },
            {
                "id": 3,
                "name": "CSS3",
                "version": null
            },
            {
                "id": 38,
                "name": "Bootstrap",
                "version": null
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 21,
                "name": "TypeScript",
                "version": null
            },
            {
                "id": 24,
                "name": "Angular",
                "version": "13"
            },
            {
                "id": 31,
                "name": "AWS S3",
                "version": null
            }
        ],
        "category": {
            "id": 9,
            "name": "Profesional",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 11,
        "portfolioName": "Siniestros",
        "clientName": "CLAVE - Tecnología",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FCLL.png?alt=media&token=e3fc1f0b-63b8-41b3-93d9-dfb1a3d8dac4",
        "description": "Es un Módulo de Kinetyc PAS Life, orientado a la gestión de denuncias y siniestros relacionados con seguros de vida y salud individual. Su funcionalidad se centra en simplificar la administración de datos mediante la creación de una bitácora y el control efectivo de los plazos de liquidación.\n\nEn mi participación en este proyecto, mi enfoque principal fue la optimización de los tiempos de respuesta de la aplicación. Implementé la integración con una API dedicada a la creación de roles asociados a denuncias y siniestros, refactore los controladores del frontend y mejoré el proceso de carga de archivos estáticos.\n\nConsidero que uno de mis mayores logros fue la adaptación ágil al modelo de negocio del módulo. Posteriormente, destaca la optimización de los tiempos de respuesta de la aplicación, logrando reducciones notables que oscilaron entre un 40% y un 80%. Esta mejora significativa no solo impulsó la eficiencia operativa, sino que también contribuyó a una experiencia más ágil y satisfactoria para los usuarios finales.",
        "repository": "",
        "demo": "",
        "startDate": "2021-04-19T04:00:00",
        "endDate": "2021-09-30T03:00:00",
        "publishDate": "2023-09-02T15:38:28",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 28,
                "name": "Bitbucket",
                "version": null
            },
            {
                "id": 18,
                "name": "Jenkins",
                "version": null
            },
            {
                "id": 4,
                "name": "Maven",
                "version": null
            },
            {
                "id": 15,
                "name": "PostgreSQL",
                "version": null
            },
            {
                "id": 9,
                "name": "Hibernate",
                "version": null
            },
            {
                "id": 10,
                "name": "Spring Framework",
                "version": null
            },
            {
                "id": 39,
                "name": "REST",
                "version": null
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 37,
                "name": "ExtJS",
                "version": "5"
            }
        ],
        "category": {
            "id": 9,
            "name": "Profesional",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 10,
        "portfolioName": "Kamaleon",
        "clientName": "CLAVE - Tecnología",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FKML.png?alt=media&token=e407cfdf-0cd8-4b28-bd28-4bb7eb31971d",
        "description": "Esta aplicación revoluciona la personalización de aplicaciones web al proporcionar a los intermediarios la capacidad de adaptar completamente la interfaz a sus necesidades y campañas comerciales. Permite que un intermediario, al poseer una campaña comercial, gestione todo el proceso, desde la creación de cotizaciones hasta la obtención de pólizas completamente personalizadas con sus propios colores, logotipos, banners y tipografías exclusivas. Para ilustrar, si la empresa de seguros ”Fantasía” brinda este sistema a un intermediario como ”Seguros Verdes”, este último puede modificar la apariencia de la aplicación web. Al enviar enlaces para que sus clientes realicen cotizaciones, estos experimentarán la página con la identidad visual exclusiva de ”Seguros Verdes”, sin ninguna confusión sobre la asociación con ”Seguros Fantasía”.\n\nEn mi papel en este proyecto, trabajé en estrecha colaboración con el arquitecto para diseñar la base de datos. Además, lideré el desarrollo integral de la aplicación utilizando Java 11 y Spring Boot. Implementé con éxito una integración con Amazon S3 para almacenar los cambios realizados por los usuarios. También contribuí al proyecto desde el lado de Angular, aportando en el desarrollo de algunas funcionalidades clave.\n\nUno de los desafíos más significativos, que considero también un logro destacado, fue proponer y liderar el desarrollo del backend de este proyecto utilizando Spring Boot. Esta iniciativa se convirtió posteriormente en la base para la actualización de varias aplicaciones existentes dentro de la misma empresa. Además, se adoptó Spring Boot como tecnología obligatoria para futuros desarrollos. Esta decisión estratégica no solo mejoró la eficiencia del proyecto actual, sino que también marcó el camino hacia una evolución tecnológica más amplia para la empresa en futuros proyectos.",
        "repository": "",
        "demo": "",
        "startDate": "2021-01-18T03:00:00",
        "endDate": "2023-03-20T03:00:00",
        "publishDate": "2023-09-02T15:34:34",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 28,
                "name": "Bitbucket",
                "version": null
            },
            {
                "id": 15,
                "name": "PostgreSQL",
                "version": null
            },
            {
                "id": 18,
                "name": "Jenkins",
                "version": null
            },
            {
                "id": 4,
                "name": "Maven",
                "version": null
            },
            {
                "id": 7,
                "name": "Java",
                "version": "11"
            },
            {
                "id": 11,
                "name": "Springboot",
                "version": null
            },
            {
                "id": 12,
                "name": "Spring Data JPA",
                "version": null
            },
            {
                "id": 13,
                "name": "Spring Security",
                "version": null
            },
            {
                "id": 19,
                "name": "Spring Web",
                "version": null
            },
            {
                "id": 2,
                "name": "HTML5",
                "version": ""
            },
            {
                "id": 3,
                "name": "CSS3",
                "version": null
            },
            {
                "id": 38,
                "name": "Bootstrap",
                "version": null
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 21,
                "name": "TypeScript",
                "version": null
            },
            {
                "id": 24,
                "name": "Angular",
                "version": "13"
            },
            {
                "id": 34,
                "name": "Firebase Storage",
                "version": null
            },
            {
                "id": 31,
                "name": "AWS S3",
                "version": null
            }
        ],
        "category": {
            "id": 9,
            "name": "Profesional",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 9,
        "portfolioName": "Portafolio API 1.0",
        "clientName": "",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FPortfolio-api-v2.png?alt=media&token=18295885-4894-416e-ab60-6b0928aa6456",
        "description": "Después de completar un curso de Java Spring Boot, sentí la necesidad de aplicar mis conocimientos en un proyecto propio para consolidar y profundizar mi comprensión de la tecnología. Reconociendo que la práctica es fundamental para el aprendizaje continuo, decidí llevar a cabo una mejora en mi portafolio, abandonando el uso de Firebase Database y optando por desarrollar una aplicación backend en Java.\n\nEl proceso fue fascinante, desde la conceptualización y diseño de un modelo de bases de datos relacional para la gestión de la información hasta la exposición de los datos mediante una API Rest. El conjunto tecnológico utilizado para este desafío personal incluyó herramientas como Gradle, Java 11 (OpenJDK), PostgreSQL para el almacenamiento de datos, y varios proyectos de Spring, entre ellos Spring JPA Repository, Web, Security, entre otros.\n\nPara la implementación y despliegue de la aplicación en la web, elegí la plataforma Heroku. Es importante mencionar que, aunque anteriormente estaba disponible, en la actualidad la aplicación no se encuentra accesible debido a cambios en las políticas de Heroku, que ahora conllevan costos por el uso de algunos de sus servicios.\n\nEste proyecto no solo representó una oportunidad emocionante para aplicar y consolidar mis conocimientos en Spring Boot, sino que también me permitió enfrentar desafíos reales relacionados con el diseño de bases de datos, el desarrollo de una API eficiente y la implementación en una plataforma de alojamiento en la nube. A pesar de la indisponibilidad actual, la experiencia adquirida ha sido invaluable para mi crecimiento como desarrollador.",
        "repository": null,
        "demo": "https://portfolio-crisortega.web.app/",
        "startDate": "2020-10-05T03:00:00",
        "endDate": "2020-12-07T03:00:00",
        "publishDate": "2023-09-02T15:32:59",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 5,
                "name": "Gradle",
                "version": null
            },
            {
                "id": 15,
                "name": "PostgreSQL",
                "version": null
            },
            {
                "id": 7,
                "name": "Java",
                "version": "11"
            },
            {
                "id": 11,
                "name": "Springboot",
                "version": null
            },
            {
                "id": 12,
                "name": "Spring Data JPA",
                "version": null
            },
            {
                "id": 13,
                "name": "Spring Security",
                "version": null
            },
            {
                "id": 19,
                "name": "Spring Web",
                "version": null
            },
            {
                "id": 41,
                "name": "Heroku",
                "version": null
            }
        ],
        "category": {
            "id": 11,
            "name": "Personal",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 8,
        "portfolioName": "Portafolio 2.0",
        "clientName": "",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2Fportfolio-angular-v1.png?alt=media&token=f15bf556-282f-4d26-b79c-1a663107c630",
        "description": "Este proyecto surge como respuesta a la problemática de gestionar un portafolio estático. La inconveniencia de tener que modificar constantemente archivos HTML, JavaScript y otros para agregar nuevos proyectos, imágenes, certificaciones o simplemente editar texto, motivó el desarrollo de un sistema de gestión de contenidos (CMS) para simplificar la publicación de contenido en mi sitio web.\n\nEn el frontend, opté por utilizar Angular 8 para ambas secciones del proyecto. Una sección estaba diseñada para presentar información a los visitantes del sitio, y la otra estaba destinada a la administración interna. Para el estilo, empleé Bootstrap en la sección pública y Angular Material en la sección administrativa.\n\nEn cuanto al backend, decidí utilizar Firebase, aprovechando sus diversas herramientas. Firebase Hosting se utilizó para alojar el sitio, Firebase Storage para almacenar imágenes diversas empleadas en el sitio, y Firebase Database para guardar la información mostrada en el sitio web.\n\nLamentablemente, tuve que dar de baja este portafolio por diversos motivos, siendo el principal la pérdida de mi cuenta de GitHub. Cuando finalmente recuperé las fuentes, había pasado demasiado tiempo, y la versión de Angular estaba considerablemente deprecada. En lugar de mantener una versión obsoleta, opté por darle un aspecto más fresco al sitio con una nueva versión y un diseño renovado.",
        "repository": "https://github.com/crisortegamunoz/fisrt-portoflio-angular",
        "demo": "https://portfolio-crisortega.web.app/",
        "startDate": "2020-05-29T04:00:00",
        "endDate": "2020-12-20T03:00:00",
        "publishDate": "2023-09-02T15:16:00",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 27,
                "name": "Github",
                "version": null
            },
            {
                "id": 2,
                "name": "HTML5",
                "version": ""
            },
            {
                "id": 3,
                "name": "CSS3",
                "version": null
            },
            {
                "id": 38,
                "name": "Bootstrap",
                "version": null
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 21,
                "name": "TypeScript",
                "version": null
            },
            {
                "id": 22,
                "name": "Angular",
                "version": "8"
            },
            {
                "id": 40,
                "name": "Angular Material",
                "version": null
            },
            {
                "id": 33,
                "name": "Firebase Hosting",
                "version": null
            },
            {
                "id": 34,
                "name": "Firebase Storage",
                "version": null
            },
            {
                "id": 35,
                "name": "Firebase Database",
                "version": null
            },
            {
                "id": 36,
                "name": "Firebase Authentication",
                "version": null
            }
        ],
        "category": {
            "id": 11,
            "name": "Personal",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 7,
        "portfolioName": "Seguros Garantía",
        "clientName": "CLAVE - Tecnología",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FPAS.png?alt=media&token=a06babb7-010c-4e71-a39c-2ee9eaeea4dd",
        "description": "Es un módulo de Kinetyc Platform, conocido como ”PAS”, se enfoca en los procesos de autoatención de clientes y canales específicamente relacionados con la cotización, propuesta, suscripción y emisión de seguros de garantía. Es crucial destacar que los usuarios finales solo pueden llevar a cabo este flujo accediendo mediante una campaña comercial.\n\nMi participación en este proyecto comenzó como desarrollador FullStack, encargándome de la mantención y desarrollo de nuevas funcionalidades. Con el tiempo, evolucioné hacia el rol de líder técnico, asumiendo el control de la aplicación y participando activamente en reuniones directas con el cliente. Esta transición implicó analizar la factibilidad de los requerimientos del cliente y evaluar su implementación en la plataforma.\n\nEl desafío más significativo de este proyecto fue, como mencioné anteriormente, asumir el rol de líder técnico. Esto implicó liderar un equipo, asumir responsabilidades y asignar tareas a los desarrolladores.\n\nUno de mis mayores logros en este proyecto fue la optimización de los tiempos de respuesta en diversos servicios, logrando reducciones significativas que oscilaron entre un 30% y un 70%, dependiendo del servicio. Esta mejora no solo contribuyó a la eficiencia operativa, sino que también impactó positivamente en la experiencia general del usuario. La capacidad de liderazgo y la implementación exitosa de mejoras técnicas son aspectos que destacan en mi contribución a este proyecto.",
        "repository": "",
        "demo": "",
        "startDate": "2020-04-20T04:00:00",
        "endDate": "2023-05-31T04:00:00",
        "publishDate": "2023-09-02T15:12:28",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 28,
                "name": "Bitbucket",
                "version": null
            },
            {
                "id": 2,
                "name": "HTML5",
                "version": ""
            },
            {
                "id": 3,
                "name": "CSS3",
                "version": null
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 21,
                "name": "TypeScript",
                "version": null
            },
            {
                "id": 4,
                "name": "Maven",
                "version": null
            },
            {
                "id": 14,
                "name": "Oracle",
                "version": null
            },
            {
                "id": 18,
                "name": "Jenkins",
                "version": null
            },
            {
                "id": 6,
                "name": "Java",
                "version": "8"
            },
            {
                "id": 9,
                "name": "Hibernate",
                "version": null
            },
            {
                "id": 10,
                "name": "Spring Framework",
                "version": null
            },
            {
                "id": 31,
                "name": "AWS S3",
                "version": null
            },
            {
                "id": 24,
                "name": "Angular",
                "version": "13"
            },
            {
                "id": 39,
                "name": "REST",
                "version": null
            }
        ],
        "category": {
            "id": 9,
            "name": "Profesional",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 6,
        "portfolioName": "Campañas Comerciales",
        "clientName": "CLAVE - Tecnología",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2Fmkc.png?alt=media&token=043e6428-31ac-46a8-9b29-f9a9cd71d311",
        "description": "Es parte de plataforma Kinetyc, se centra en la creación de campañas comerciales basadas en convenios comerciales preconfigurados. Este módulo posibilita que una compañía de seguros presente una serie de productos en oferta a sus clientes, así como también permite a un intermediario proporcionar un enlace donde los clientes pueden visualizar y cotizar productos específicos.\n\nMi responsabilidad abarcó el desarrollo completo de esta aplicación, desde la implementación de servicios backend utilizando Spring Framework hasta el desarrollo del frontend con Angular 8 en sus primeras etapas. A medida que asumí la responsabilidad del equipo de mantenimiento, se llevaron a cabo actualizaciones y mejoras en la aplicación, incorporando nuevas funcionalidades y actualizando la versión de Angular 8 a la versión 13.\n\nEste proyecto marcó mi primera incursión profesional en Angular, y agradezco a la empresa que me proporcionó capacitación en Angular mediante un curso en la academia en línea ”Escalab”. Además, por iniciativa propia, realicé el curso de Angular ofrecido en Platzi para potenciar y mejorar mis habilidades rápidamente. Enfrentando este desafío de manera más efectiva, logré completar la entrega del proyecto dentro del plazo estimado.",
        "repository": "",
        "demo": "",
        "startDate": "2020-03-16T03:00:00",
        "endDate": "2023-05-31T04:00:00",
        "publishDate": "2023-09-02T15:10:05",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 28,
                "name": "Bitbucket",
                "version": null
            },
            {
                "id": 2,
                "name": "HTML5",
                "version": ""
            },
            {
                "id": 3,
                "name": "CSS3",
                "version": null
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 21,
                "name": "TypeScript",
                "version": null
            },
            {
                "id": 18,
                "name": "Jenkins",
                "version": null
            },
            {
                "id": 4,
                "name": "Maven",
                "version": null
            },
            {
                "id": 14,
                "name": "Oracle",
                "version": null
            },
            {
                "id": 6,
                "name": "Java",
                "version": "8"
            },
            {
                "id": 9,
                "name": "Hibernate",
                "version": null
            },
            {
                "id": 10,
                "name": "Spring Framework",
                "version": null
            },
            {
                "id": 24,
                "name": "Angular",
                "version": "13"
            },
            {
                "id": 39,
                "name": "REST",
                "version": null
            }
        ],
        "category": {
            "id": 9,
            "name": "Profesional",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 5,
        "portfolioName": "Rick & Morty",
        "clientName": "",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FRick_And_Morty.png?alt=media&token=7b74d563-0d20-4a3e-8ce2-41a059ed2f4c",
        "description": "Este mini proyecto surge como resultado de una de las tareas asignadas durante el curso de Angular impartido por Escalab. De todas las tareas que tuve que desarrollar, este es mi favorito, ya que tuve la oportunidad de abordar un proyecto con pensamiento libre. Por esta razón, decidí utilizar la API de The Rick and Morty para crear un sitio de aplicación de una sola página (SPA) ambientado en esta serie animada.\n\n¿Por qué me gustó tanto? Las razones son simples. Principalmente, después de mucho tiempo, pude ”jugar” con el diseño de un sitio web utilizando HTML y CSS. Exploré y experimenté con algunos paquetes para mejorar el sitio, como un paginador para los personajes de la serie y un efecto de deslizamiento que utilicé como banner en la página web.\n\nAdemás, había leído previamente sobre Firebase, investigué más y lo apliqué en el proyecto utilizando una de sus herramientas llamada ”hosting” para proporcionar una demostración del sitio. De esta manera, cualquier persona podría ver el proyecto sin necesidad de descargar el código fuente desde mi GitHub.",
        "repository": "https://github.com/crisortegamunoz/CursoAngularLaEscalab/tree/master/Clase%204/rickandmorty",
        "demo": "https://rick-and-morty-api-desafio.web.app/",
        "startDate": "2020-04-03T03:00:00",
        "endDate": "2020-04-11T04:00:00",
        "publishDate": "2023-09-02T15:05:39",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 27,
                "name": "Github",
                "version": null
            },
            {
                "id": 2,
                "name": "HTML5",
                "version": ""
            },
            {
                "id": 3,
                "name": "CSS3",
                "version": null
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 21,
                "name": "TypeScript",
                "version": null
            },
            {
                "id": 22,
                "name": "Angular",
                "version": "8"
            },
            {
                "id": 33,
                "name": "Firebase Hosting",
                "version": null
            }
        ],
        "category": {
            "id": 10,
            "name": "Laboratorio",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 4,
        "portfolioName": "Convenios Comerciales",
        "clientName": "CLAVE - Tecnología",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FPRA.png?alt=media&token=2f7575d4-97ee-407b-bd88-ea891b787d41",
        "description": "Parte de la plataforma Kinetyc, destinado al registro de las condiciones de comercialización con intermediarios destaca por permitir el registro de variables de tarificación y capacidades de venta en diversos formatos de relación comercial. Estos formatos involucran a los roles de asegurador, intermediario, contratante y asegurado.\n\nMi participación en este proyecto fue como desarrollador Fullstack, y lo que lo diferenció de otros proyectos fue la modalidad de trabajo, ya que el cliente solicitó que el equipo operara desde sus instalaciones. Esta fue mi primera experiencia trabajando como externo, lo que implicó adaptarme al entorno y colaborar directamente con los clientes.\n\nCon una mayor experiencia como desarrollador, asumí tareas de análisis de requerimientos y propuse ideas para mejorar la experiencia del usuario y la forma en que estábamos desarrollando el código. Esta experiencia no solo amplió mi conjunto de habilidades técnicas, sino que también me brindó la oportunidad de contribuir proactivamente al proceso de desarrollo, ofreciendo sugerencias y mejoras para optimizar la eficiencia y la usabilidad del sistema.",
        "repository": "",
        "demo": "",
        "startDate": "2019-03-18T03:00:00",
        "endDate": "2023-05-31T04:00:00",
        "publishDate": "2023-09-02T05:30:32",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 28,
                "name": "Bitbucket",
                "version": null
            },
            {
                "id": 18,
                "name": "Jenkins",
                "version": null
            },
            {
                "id": 4,
                "name": "Maven",
                "version": null
            },
            {
                "id": 14,
                "name": "Oracle",
                "version": null
            },
            {
                "id": 6,
                "name": "Java",
                "version": "8"
            },
            {
                "id": 9,
                "name": "Hibernate",
                "version": null
            },
            {
                "id": 10,
                "name": "Spring Framework",
                "version": null
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 37,
                "name": "ExtJS",
                "version": "5"
            },
            {
                "id": 39,
                "name": "REST",
                "version": null
            }
        ],
        "category": {
            "id": 9,
            "name": "Profesional",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 3,
        "portfolioName": "Seguros de Vida",
        "clientName": "CLAVE - Tecnología",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FAGL.png?alt=media&token=afd789c6-33e5-4255-a479-60dfaa92c0bb",
        "description": "Módulo central de Kinetyc PAS Life, desempeña un papel crucial en el manejo integral de los procesos de cotización, propuesta, suscripción, emisión, plan de pago y endoso. AGL (Administración de Gestión de la Liquidación) contiene la base de pólizas y clientes asociados a ellas. El proceso de emisión se simplifica en una secuencia de cuatro pasos: Cotizar → Ingresar datos de propuesta → Ingresar datos de pago → Suscribir y emitir.\n\nMi rol en este proyecto fue como desarrollador FullStack. Aunque ya me había adaptado al framework frontend utilizado en la empresa, este proyecto marcó mi acercamiento profesional a Java y sus propios frameworks, como Hibernate y Spring.\n\nTodo lo que aprendí durante este proyecto se lo debo a un compañero de equipo llamado Jaime Cisternas, quien tuvo la paciencia de guiarme y enseñarme sobre metodologías de trabajo como los principios SOLID, así como asegurar la calidad del código. Gracias a sus enseñanzas, no solo mejoré mis habilidades de programación, sino que también comprendí el funcionamiento de Hibernate y Spring en proyectos Java de gran escala.\n\nQuisiera destacar lo que considero mi mayor logro en este proyecto: capacitar a los nuevos integrantes de la célula en el framework ExtJS. Este proceso no solo implicó transmitir conocimientos técnicos, sino también compartir la experiencia y las mejores prácticas adquiridas a lo largo del proyecto, contribuyendo así al crecimiento y desarrollo del equipo.",
        "repository": "",
        "demo": "",
        "startDate": "2017-03-06T03:00:00",
        "endDate": "2018-12-28T03:00:00",
        "publishDate": "2023-09-02T01:41:58",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 18,
                "name": "Jenkins",
                "version": null
            },
            {
                "id": 28,
                "name": "Bitbucket",
                "version": null
            },
            {
                "id": 15,
                "name": "PostgreSQL",
                "version": null
            },
            {
                "id": 4,
                "name": "Maven",
                "version": null
            },
            {
                "id": 6,
                "name": "Java",
                "version": "8"
            },
            {
                "id": 9,
                "name": "Hibernate",
                "version": null
            },
            {
                "id": 10,
                "name": "Spring Framework",
                "version": null
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 37,
                "name": "ExtJS",
                "version": "5"
            },
            {
                "id": 39,
                "name": "REST",
                "version": null
            }
        ],
        "category": {
            "id": 9,
            "name": "Profesional",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 2,
        "portfolioName": "Líneas Comerciales",
        "clientName": "CLAVE - Tecnología",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FAGC.png?alt=media&token=92d0066e-d1f0-4d8e-9c6d-23961c6e8905",
        "description": "Parte de Kinetyc Platform, orientado a los seguros de garantía y utilizado por intermediarios internos de una compañía, abarca todo el proceso de manejo de cotización, propuesta, suscripción, emisión, plan de pago y endoso. AGL contiene la base de pólizas y clientes asociados a ellos.\n\nDurante los años que trabajé en este proyecto, mi rol consistió en llevar a cabo mantenciones, mejoras y la implementación de nuevas funcionalidades al módulo para potenciar su uso. Enfrenté tareas desafiantes, particularmente relacionadas con la refactorización de código. Prácticamente, descomponer el proyecto en nuevos archivos estáticos fue esencial, ya que toda la funcionalidad del aplicativo estaba concentrada en dos controladores.\n\nConsidero mi mayor logro en este proyecto haber completado con éxito la tarea mencionada anteriormente. Esta acción no solo contribuyó a mejorar los tiempos de respuesta en la descarga de archivos estáticos, sino que también facilitó la vida de los nuevos desarrolladores que se unían al equipo. La legibilidad del código mejoró significativamente, haciendo que fuera más fácil de entender, lo que resultó en una experiencia de desarrollo más eficiente y efectiva especialmente para los desarrolladores nuevos que se integraban al proyecto.",
        "repository": "",
        "demo": "",
        "startDate": "2016-10-10T03:00:00",
        "endDate": "2023-05-31T04:00:00",
        "publishDate": "2023-09-02T01:36:33",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 28,
                "name": "Bitbucket",
                "version": null
            },
            {
                "id": 18,
                "name": "Jenkins",
                "version": null
            },
            {
                "id": 14,
                "name": "Oracle",
                "version": null
            },
            {
                "id": 4,
                "name": "Maven",
                "version": null
            },
            {
                "id": 6,
                "name": "Java",
                "version": "8"
            },
            {
                "id": 9,
                "name": "Hibernate",
                "version": null
            },
            {
                "id": 10,
                "name": "Spring Framework",
                "version": null
            },
            {
                "id": 17,
                "name": "PL/SQL",
                "version": null
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 37,
                "name": "ExtJS",
                "version": "5"
            },
            {
                "id": 39,
                "name": "REST",
                "version": null
            }
        ],
        "category": {
            "id": 9,
            "name": "Profesional",
            "section": "PORTFOLIO"
        }
    },
    {
        "id": 1,
        "portfolioName": "Kinetyc Cobranza",
        "clientName": "CLAVE - Tecnología",
        "img": "https://firebasestorage.googleapis.com/v0/b/cms-portfolio-firebase.appspot.com/o/images%2Fportfolio%2Fcrisortega%2FCOL.png?alt=media&token=f1657c4c-b32a-4934-8995-4ab5f19ab355",
        "description": "Parte de Kinetyc Platform, se centra en la gestión de procesos de activación de mandatos de cobros de pólizas, brindando soporte para diversos medios de pago automáticos como Transbank, entidades bancarias y Previred.\n\nEste proyecto marcó mi inicio como profesional y desarrollador junior, siendo mi primera experiencia en el mundo laboral. Tuve que enfrentar el estrés y la ansiedad al aprender rápidamente sobre Spring Framework, Hibernate y ExtJS.\n\nA medida que avanzaba en el proyecto, me adaptaba gradualmente a estas tecnologías, lo que aumentaba mi confianza y me permitía superar mis tareas. Es crucial destacar que el equipo siempre estuvo dispuesto a apoyarme en mis responsabilidades, brindándome enseñanzas sobre el negocio y las tecnologías. Sin duda, no habría logrado cumplir mis tareas sin su ayuda y paciencia.\n\nDesde mi perspectiva, las universidades deberían preparar de manera más efectiva a los estudiantes para enfrentar estas emociones. Asimismo, algunas empresas deberían ser conscientes de las necesidades de sus colaboradores juniors, proporcionándoles capacitación en las tecnologías que utilizan en lugar de ”lanzarlos a los leones”. Esto no solo beneficiaría a los empleados, sino que también contribuiría a mejorar la calidad del código y la eficiencia en el desarrollo de proyectos.",
        "repository": "",
        "demo": "",
        "startDate": "2016-06-06T04:00:00",
        "endDate": "2016-12-21T03:00:00",
        "publishDate": "2023-09-02T01:28:43",
        "technologies": [
            {
                "id": 1,
                "name": "Git",
                "version": null
            },
            {
                "id": 28,
                "name": "Bitbucket",
                "version": null
            },
            {
                "id": 18,
                "name": "Jenkins",
                "version": null
            },
            {
                "id": 6,
                "name": "Java",
                "version": "8"
            },
            {
                "id": 14,
                "name": "Oracle",
                "version": null
            },
            {
                "id": 4,
                "name": "Maven",
                "version": null
            },
            {
                "id": 9,
                "name": "Hibernate",
                "version": null
            },
            {
                "id": 10,
                "name": "Spring Framework",
                "version": null
            },
            {
                "id": 20,
                "name": "JavaScript",
                "version": null
            },
            {
                "id": 37,
                "name": "ExtJS",
                "version": "5"
            }
        ],
        "category": {
            "id": 9,
            "name": "Profesional",
            "section": "PORTFOLIO"
        }
    }
]